Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: :echo uk2nl['one'] < een ~
es_es: :echo es2nl['uno'] < een ~

source: :echo uk2nl.one < een ~
es_es: :echo es2nl.uno < een ~

source: This only works for a key that is made of ASCII letters, digits and the underscore. You can also assign a new value this way: >
es_es: Esto sólo funciona con claves compuestas de caracteres ASCII, dígitos, y el guión bajo. También puede usar esta notación para asignar valores: >

source: :let uk2nl.four = 'vier' :echo uk2nl < {'three': 'drie', 'four': 'vier', 'one': 'een', 'two': 'twee'} ~
es_es: :let es2nl.cuatro = 'vier' :echo es2nl < {'tres': 'drie', 'cuatro': 'vier', 'uno': 'een', 'dos': 'twee'} ~

source: :function uk2nl.translate(line) dict : return join(map(split(a:line), 'get(self, v:val, "???")')) :endfunction
es_es: :function es2nl.traducir(linea) dict : return join(map(split(a:linea), 'get(self, v:val, "???")')) :endfunction

source: :echo uk2nl.translate('three two five one') < drie twee ??? een ~
es_es: :echo es2nl.traducir('tres dos cinco uno') < drie twee ??? een ~

source: The first special thing you notice is the "dict" at the end of the ":function" line. This marks the function as being used from a Dictionary. The "self" local variable will then refer to that Dictionary. Now let's break up the complicated return command: >
es_es: Lo que habrá notado primero es el «dict» al final de la línea «:function». Así se indica que la función será usada desde un Diccionario. La variable local «self» se referirá a dicho diccionario. Ahora, dividamos esa compleja instrucción de retorno: >

source: split(a:line)
es_es: split(a:linea)

source: The split() function takes a string, chops it into white separated words and returns a list with these words. Thus in the example it returns: >
es_es: La función split() toma una cadena, la divide en palabras separadas por espacios en blanco, y entrega una lista con estas palabras. En el ejemplo previo, entrega: >

source: :echo split('three two five one') < ['three', 'two', 'five', 'one'] ~
es_es: :echo split('tres dos cinco uno') < ['tres', 'dos', 'cinco', 'uno'] ~

source: This list is the first argument to the map() function. This will go through the list, evaluating its second argument with "v:val" set to the value of each item. This is a shortcut to using a for loop. This command: >
es_es: Esta lista es el primer argumento para la función map(). Dicha función analizará la lista, evaluando su segundo argumento con la variable «v:val» definida con el valor de cada elemento en la lista. Es una abreviación de un ciclo for. Esta instrucción: >

source: :let alist = map(split(a:line), 'get(self, v:val, "???")')
es_es: :let lista = map(split(a:linea), 'get(self, v:val, "???")')

source: :let alist = split(a:line) :for idx in range(len(alist)) : let alist[idx] = get(self, alist[idx], "???") :endfor
es_es: :let lista = split(a:linea) :for ind in range(len(lista)) : let lista[ind] = get(self, lista[ind], "???") :endfor

source: The get() function checks if a key is present in a Dictionary. If it is, then the value is retrieved. If it isn't, then the default value is returned, in the example it's '???'. This is a convenient way to handle situations where a key may not be present and you don't want an error message.
es_es: La función get() comprueba si una clave existe en un Diccionario. Si existe, devuelve el valor asociado a la clave. Si no existe, devuelve el valor definido como predeterminado, que en el ejemplo es '???'. Esto permite manejar de una forma conveniente las situaciones en que una clave no existe y no desea hacer el manejo del error que provocaría dicha situación.

source: The join() function does the opposite of split(): it joins together a list of words, putting a space in between. This combination of split(), map() and join() is a nice way to filter a line of words in a very compact way.
es_es: La función join() es el complemento de split(): une una lista de palabras, separándolas con un espacio. La combinación de split(), map(), y join() es una forma elegante de filtrar una cadena de palabras de manera sucinta.

source: Now that you can put both values and functions in a Dictionary, you can actually use a Dictionary like an object. Above we used a Dictionary for translating Dutch to English. We might want to do the same for other languages. Let's first make an object (aka Dictionary) that has the translate function, but no words to translate: >
es_es: Ahora que podemos guardar valores y funciones en un Diccionario, podemos usar un Diccionario como un objeto. Anteriormente hicimos uso de un Diccionario para traducir texto de Holandés a Español. Querríamos hacer lo mismo para otros idiomas. Primero crearemos un objeto (esto es, un Diccionario) que tenga la función traducir, pero no tenga palabras para traducir: >

source: :let transdict = {} :function transdict.translate(line) dict : return join(map(split(a:line), 'get(self.words, v:val, "???")')) :endfunction
es_es: :let dicctraductor = {} :function dicctraductor.traducir(linea) dict : return join(map(split(a:linea), \ 'get(self.palabras, v:val, "???")')) :endfunction

source: It's slightly different from the function above, using 'self.words' to lookup word translations. But we don't have a self.words. Thus you could call this an abstract class.
es_es: La definición es ligeramente diferente de la función anterior, ya que usa 'self.words' para buscar las traducciones de palabras. Pero no hay un self.words. Por esto decir que el Diccionario es una clase abstracta.

source: :let uk2nl = copy(transdict) :let uk2nl.words = {'one': 'een', 'two': 'twee', 'three': 'drie'} :echo uk2nl.translate('three one') < drie een ~
es_es: :let es2nl = copy(dicctraductor) :let es2nl.words = {'uno': 'een', 'dos': 'twee', 'tres': 'drie'} :echo es2nl.translate('tres uno') < drie een ~

source: :let uk2de = copy(transdict) :let uk2de.words = {'one': 'ein', 'two': 'zwei', 'three': 'drei'} :echo uk2de.translate('three one') < drei ein ~
es_es: :let es2de = copy(dicctraductor) :let es2de.words = {'uno': 'ein', 'dos': 'zwei', 'tres': 'drei'} :echo es2de.translate('tres uno') < drei ein ~

source: You see that the copy() function is used to make a copy of the "transdict" Dictionary and then the copy is changed to add the words. The original remains the same, of course.
es_es: Puede ver que la función copy() se usa para crear una copia del Diccionario «dicctraductor» y luego se cambia la copia, añadiendo las palabras. El original, por supuesto, permanece intacto.

source: :if $LANG =~ "de" : let trans = uk2de :else : let trans = uk2nl :endif :echo trans.translate('one two three') < een twee drie ~
es_es: :if $LANG =~ "de" : let trad = es2de :else : let trad = es2nl :endif :echo trad.traducir('uno dos tres') < een twee drie ~

source: Here "trans" refers to one of the two objects (Dictionaries). No copy is made. More about List and Dictionary identity can be found at |list-identity| and |dict-identity|.
es_es: Aquí «trad» se refiere a uno de dos posibles objetos (Diccionarios). No se hace ninguna copia. Puede encontrar más información acerca de la identidad de Listas y Diccionarios en |list-identity| y |dict-identity|.

source: Now you might use a language that isn't supported. You can overrule the translate() function to do nothing: >
es_es: Puede que use un idioma que aún no esté incluido. Para este caso, puede redefinir la función traducir() para que no haga nada: >

source: :let uk2uk = copy(transdict) :function! uk2uk.translate(line) : return a:line :endfunction :echo uk2uk.translate('three one wladiwostok') < three one wladiwostok ~
es_es: :let es2es = copy(dicctraductor) :function! es2es.traducir(linea) : return a:linea :endfunction :echo es2es.traducir('tres one wladiwostok') < tres uno wladiwostok ~

source: Notice that a ! was used to overwrite the existing function reference. Now use "uk2uk" when no recognized language is found: >
es_es: Note el «!» utilizado para redefinir la referencia a función existente. Ahora puede usar «es2es» cuando no se encuentra ningún idioma reconocido: >

source: :if $LANG =~ "de" : let trans = uk2de :elseif $LANG =~ "nl" : let trans = uk2nl :else : let trans = uk2uk :endif :echo trans.translate('one two three') < one two three ~
es_es: :if $LANG =~ "de" : let trad = es2de :elseif $LANG =~ "nl" : let trad = es2nl :else : let trad = es2es :endif :echo trad.traducir('uno dos tres') < uno dos tres ~

source: *41.9* Exceptions
es_es: *41.9* Excepciones

source: :try : read ~/templates/pascal.tmpl :catch /E484:/ : echo "Sorry, the Pascal template file cannot be found." :endtry
es_es: :try : read ~/plantillas/pascal.tmpl :catch /E484:/ : echo «Lo siento, no encuentro el archivo plantilla para Pascal.» :endtry

source: The ":read" command will fail if the file does not exist. Instead of generating an error message, this code catches the error and gives the user a nice message instead.
es_es: La orden «:read» (leer) fallará si el archivo no existe. En vez de mostrar un mensaje de error, este código atrapa el error y le muestra al usuario un mensaje más agradable.

source: For the commands in between ":try" and ":endtry" errors are turned into exceptions. An exception is a string. In the case of an error the string contains the error message. And every error message has a number. In this case, the error we catch contains "E484:". This number is guaranteed to stay the same (the text may change, e.g., it may be translated).
es_es: Para las instrucciones entre «:try» y «:endtry» los errores se convierten en excepciones. Una excepción es una cadena de texto. Cuando aparece un error esta cadena contiene el mensaje de error. Y cada mensaje de error tiene un número. En este caso, el error que atrapamos contiene «E484:». Vim garantiza que este número permanece inalterado (el texto del mensaje de error puede cambiar, por ejemplo, puede haber sido traducido.)

source: When the ":read" command causes another error, the pattern "E484:" will not match in it. Thus this exception will not be caught and result in the usual error message.
es_es: Cuando la orden «:read» genera un error distinto, el patrón «E484:» no coincidirá con él. La excepción no será atrapada y aparecerá el mensaje de error habitual en esos casos.

source: :try : read ~/templates/pascal.tmpl :catch : echo "Sorry, the Pascal template file cannot be found." :endtry
es_es: :try : read ~/plantillas/pascal.tmpl :catch : echo «Lo siento, no encuentro el archivo plantilla para Pascal.» :endtry

source: This means all errors are caught. But then you will not see errors that are useful, such as "E21: Cannot make changes, 'modifiable' is off".
es_es: De esta forma se atrapan todos los errores. Pero al hacerlo no verá errores que son útiles, como por ejemplo «E21: No se pudo modificar, 'modifiable' está desactivado»

source: This filters the lines from the cursor until the end of the file through the "filter" command, which takes a file name argument. No matter if the filtering works, something goes wrong in between ":try" and ":finally" or the user cancels the filtering by pressing CTRL-C, the "call delete(tmp)" is always executed. This makes sure you don't leave the temporary file behind.
es_es: Aquí se filtran las líneas desde el cursor hasta el final del archivo usando la orden «filter», que toma como argumento un nombre de archivo. No importa si el filtrado funciona, si algo sale mal entre «:try» y «:finally», o si el usuario cancela el filtrado presionando CTRL-C, la instrucción «call delete(tmp)» siempre se ejecuta. Así se asegura de que no queden archivos temporales al acabar el proceso.

source: *41.10* Various remarks
es_es: *41.10* Observaciones

source: Here is a summary of items that apply to Vim scripts. They are also mentioned elsewhere, but form a nice checklist.
es_es: A continuación tiene un resumen de los elementos relevantes para escribir scripts de Vim. También se los menciona en otros lugares de la documentación, pero aquí se presentan como una conveniente lista.

source: The end-of-line character depends on the system. For Unix a single <NL> character is used. For MS-DOS, Windows, OS/2 and the like, <CR><LF> is used. This is important when using mappings that end in a <CR>. See |:source_crnl|.
es_es: El carácter de fin de línea usado depende del sistema. En sistemas Unix se usa <NL>. En MS-DOS, Windows, OS/2 y similares, se usa <CR><LF>. Éste es un detalle importante a considerar al usar macros que terminan en <CR>. Consulte |:source_crnl|.

source: Leading whitespace characters (blanks and TABs) are always ignored. The whitespaces between parameters (e.g. between the 'set' and the 'cpoptions' in the example below) are reduced to one blank character and plays the role of a separator, the whitespaces after the last (visible) character may or may not be ignored depending on the situation, see below.
es_es: Los espacios en blanco al principio de cada línea (espacios y tabulados) siempre se ignoran. Los espacios en blanco entre parámetros (por ejemplo, entre 'set' y 'cpoptions' en el ejemplo a continuación) se reducen a un solo espacio blanco que actúa como separador, los espacios en blanco después del último carácter (visible) se pueden o no ignorar dependiendo del caso, véase a continuación.

source: the whitespace immediately before the "=" sign is ignored. But there can be no whitespace after the "=" sign!
es_es: se ignora el espacio en blanco inmediatamente antes del símbolo «=». ¡Pero no puede haber espacios a continuación del símbolo «=»!

source: :set tags=my\ nice\ file
es_es: :set tags=mi\ lindo\ archivo

source: :set tags=my nice file
es_es: :set tags=mi lindo archivo

source: :set tags=my :set nice :set file
es_es: :set tags=mi :set lindo :set archivo

source: The character " (the double quote mark) starts a comment. Everything after and including this character until the end-of-line is considered a comment and is ignored, except for commands that don't consider comments, as shown in examples below. A comment can start on any character position on the line.
es_es: El carácter " (comilla doble) marca el inicio de un comentario. Todo lo que aparece a continuación de éste carácter hasta el fin de línea, e incluyéndola, se considera un comentario y es ignorado, a excepción de las órdenes que no tienen en cuenta los comentarios, como se puede ver en ejemplos de esta sección. Un comentario puede empezar en cualquier punto de una línea de texto.

source: There is a little "catch" with comments for some commands. Examples: >
es_es: Hay un pequeño «pero» con los comentarios y ciertas órdenes. Ejemplos: >

source: :abbrev dev development " shorthand :map <F3> o#include " insert include :execute cmd " do it :!ls *.c " list C files
es_es: :abbrev des desarrollo " abreviación :map <F3> o#include " insertar directiva include :execute orden " ejecutar :!ls *.c " listar archivos C

source: The abbreviation 'dev' will be expanded to 'development " shorthand'. The mapping of <F3> will actually be the whole line after the 'o# ....' including the '" insert include'. The "execute" command will give an error. The "!" command will send everything after it to the shell, causing an error for an unmatched '"' character. There can be no comment after ":map", ":abbreviate", ":execute" and "!" commands (there are a few more commands with this restriction). For the ":map", ":abbreviate" and ":execute" commands there is a trick: >
es_es: La abreviación 'dev' se expandirá a 'desarrollo " abreviación'. La macro <F3> constará en realidad de toda la línea desde 'o# ....' incluyendo '" insertar directiva include'. La orden «execute» provocará un error. La orden «!» enviará todos los caracteres a continuación al intérprete de órdenes, provocando un error debido al carácter '"' sin la comilla de cierre correspondiente. No pueden existir comentarios a continuación de las órdenes «:map», «:abbreviate», «:execute», ni «!» (hay algunas órdenes más con esta restricción). Para el caso de las órdenes «:map», «:abbreviate», y «:execute» hay un truco disponible: >

source: :abbrev dev development|" shorthand :map <F3> o#include|" insert include :execute cmd |" do it
es_es: :abbrev des desarrollo|" abreviación :map <F3> o#include|" insertar directiva include :execute orden |" ejecutar

source: With the '|' character the command is separated from the next one. And that next command is only a comment. For the last command you need to do two things: |:execute| and use '|': > :exe '!ls *.c' |" list C files
es_es: El carácter «|» permite separar órdenes. En este caso, la siguiente orden es simplemente un comentario. Para la última orden hay que hacer dos cosas: |:execute| y usar «|»: > :exe '!ls *.c' |" listar archivos C

source: Notice that there is no white space before the '|' in the abbreviation and mapping. For these commands, any character until the end-of-line or '|' is included. As a consequence of this behavior, you don't always see that trailing whitespace is included: >
es_es: Observe que no hay espacios en blanco antes de «|» en la abreviación ni en la macro. En estas órdenes, se incluye cualquier carácter hasta el fin de línea o hasta «|». Como consecuencia de este comportamiento, no siempre es visible cuándo se incluyen espacios en blanco al final del a línea: >

source: For Unix there is one special way to comment a line, that allows making a Vim script executable: > #!/usr/bin/env vim -S echo "this is a Vim script" quit
es_es: En Unix hay una forma especial de hacer un comentario, que permite hacer que un script de Vim sea ejecutable: > #!/usr/bin/env vim -S echo "este es un script de Vim" quit

source: The "#" command by itself lists a line with the line number. Adding an exclamation mark changes it into doing nothing, so that you can add the shell command to execute the rest of the file. |:#!| |-S|
es_es: Por sí misma, la orden «#» muestra una línea junto con su número de línea. Al añadirle un símbolo de exclamación su comportamiento cambia y no tiene efecto, así que puede añadir la orden de intérprete de órdenes para ejecutar el resto del archivo. |:#!| |-S|

source: Here the unmap command will not work, because it tries to unmap ",ab ". This does not exist as a mapped sequence. An error will be issued, which is very hard to identify, because the ending whitespace character in ":unmap ,ab " is not visible.
es_es: Aquí la orden unmap no funcionará, porque trata de eliminar la macro «,ab ». Ésta no existe como secuencia de ninguna macro. Se mostrará un error, que es muy difícil de identificar, porque el carácter de espacio final en «:unmap ,ab» no es visible.

source: :unmap ,ab " comment
es_es: :unmap ,ab " comentario

source: Here the comment part will be ignored. However, Vim will try to unmap ',ab ', which does not exist. Rewrite it as: >
es_es: La parte correspondiente al comentario será ignorada. Sin embargo, Vim tratará de eliminar la macro ',ab ', que no existe. Debe reescribir la orden como: >

source: :unmap ,ab| " comment
es_es: :unmap ,ab| " comentario

source: Sometimes you want to make a change and go back to where cursor was. Restoring the relative position would also be nice, so that the same line appears at the top of the window. This example yanks the current line, puts it above the first line in the file and then restores the view: >
es_es: En ocasiones es deseable hacer un cambio y volver al sitio en que el cursor se encontraba inicialmente. Recuperar la posición relativa también sería agradable, de tal forma que la misma línea inicial aparezca al inicio de la ventana. Este ejemplo copia la línea actual, la inserta antes de la primera línea en el archivo y después restaura la vista original: >

source: What this does: > ma"aYHmbgg"aP`bzt`a < ma set mark a at cursor position "aY yank current line into register a Hmb go to top line in window and set mark b there gg go to first line in file "aP put the yanked line above it `b go back to top line in display zt position the text in the window as before `a go back to saved cursor position
es_es: Esto es lo que hace: > ma"aYHmbgg"aP`bzt`a < ma pone una marca en la posición actual del cursor "aY copia la línea actual al registro a Hmb va hasta la primera línea que se ve en la ventana y pone la marca b allí gg va a la primera línea del archivo "aP pega la línea copiada por encima de la línea `b vuelve a la línea superior de la vista inicial zt ubica dicha línea como la primera de la ventana `a vuelve a la posición del cursor almacenada originalmente

source: To avoid your function names to interfere with functions that you get from others, use this scheme: - Prepend a unique string before each function name. I often use an abbreviation. For example, "OW_" is used for the option window functions. - Put the definition of your functions together in a file. Set a global variable to indicate that the functions have been loaded. When sourcing the file again, first unload the functions. Example: >
es_es: Para evitar que los nombres de funciones que defina interfieran con otras funciones, use el siguiente esquema: - Anteponga una cadena única a cada nombre de función. A menudo uso una abreviatura. Por ejemplo, uso «OV» para las funciones relacionadas con opciones de ventana. - Ponga todas las definiciones de sus funciones en un mismo archivo. Cree una variable global para indicar que las funciones ya fueron cargadas. Cuando cargue el archivo de nuevo, elimine antes las definiciones de las funciones. Ejemplo: >

source: " This is the XXX package
es_es: " Este es el paquete XXX

source: if exists("XXX_loaded") delfun XXX_one delfun XXX_two endif
es_es: if exists("XXX_cargado") delfun XXX_uno delfun XXX_dos endif

source: function XXX_one(a) ... body of function ... endfun
es_es: function XXX_uno(a) ... cuerpo de la función ... endfun

source: function XXX_two(b) ... body of function ... endfun
es_es: function XXX_dos(b) ... cuerpo de la función ... endfun

source: *41.11* Writing a plugin *write-plugin*
es_es: *41.11* Escribir extensiones *write-plugin*

source: You can write a Vim script in such a way that many people can use it. This is called a plugin. Vim users can drop your script in their plugin directory and use its features right away |add-plugin|.
es_es: Puede crear un script de Vim de tal forma que lo puedan usar varias personas. Esto se llama una extensión. Los usuarios de Vim pueden copiar el script en su directorio «plugin/», y utilizarlo en el momento con |add-plugin|.

source: In this section the first type is explained. Most items are also relevant for writing filetype plugins. The specifics for filetype plugins are in the next section |write-filetype-plugin|.
es_es: En esta sección se describirán las extensiones globales («global plugins»). La mayoría de elementos también son necesarios para escribir extensiones de tipo de archivo («filetype plugins»). La sección a continuación, |write-filetype-plugin|, detalla las extensiones de tipo de archivo.

source: First of all you must choose a name for your plugin. The features provided by the plugin should be clear from its name. And it should be unlikely that someone else writes a plugin with the same name but which does something different. And please limit the name to 8 characters, to avoid problems on old Windows systems.
es_es: Primero, debe elegir un nombre para su extensión. El nombre debería mostrar las funcionalidades ofrecidas por la extensión. Así mismo, debería ser poco probable que alguien escriba una extensión con el mismo nombre pero otras funcionalidades. Por último, limite el nombre a ocho caracteres para evitar problemas en antiguos sistemas de Windows.

source: A script that corrects typing mistakes could be called "typecorr.vim". We will use it here as an example.
es_es: Un script que corrige errores tipográficos se podría llamar «correccort.vim». Lo usaremos como ejemplo.
